app/views/ideas/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."created_at" DESC
SELECT "images".id FROM "images" INNER JOIN "idea_images" ON "images"."id" = "idea_images"."image_id" WHERE "idea_images"."idea_id" = $1  [["idea_id", 1]]
---
      <li><%= f.label :category %></li>
      <li><%= f.collection_select :category_id, Category.all,:id,:name, include_blank: true %></li><br/>
      <li><%= f.label :images %></li>
      <li class="image-list"><%= f.collection_select :image_ids, Image.all, :id, :title, { :include_blank => true }  , { :multiple => true }%></li><br/>