app/controllers/admin/categories_controller.rb

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "This Category"], ["description", "Stuff"], ["created_at", 2016-10-31 03:14:50 UTC], ["updated_at", 2016-10-31 03:14:50 UTC]]
---
  def create
    @category = Category.new(category_params)

    if @category.save