app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "New Catg"], ["description", "New Catg"], ["created_at", 2016-10-28 21:24:19 UTC], ["updated_at", 2016-10-28 21:24:19 UTC]]

  def update
    @category = Category.find(params[:id])

    if @category.update(category_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "categories" SET "description" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["description", "Test"], ["updated_at", 2016-10-29 23:11:03 UTC], ["id", 6]]