app/controllers/ideas_controller.rb

  def create
    @idea = Idea.new(idea_params)
    @idea.user_id = params[:user_id]
    @user = @idea.user

    if @idea.save
---
INSERT INTO "ideas" ("name", "description", "category_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test"], ["description", "test"], ["category_id", 1], ["user_id", 5], ["created_at", 2016-10-27 02:52:02 UTC], ["updated_at", 2016-10-27 02:52:02 UTC]]

  def update
    @idea = Idea.find(params[:id])
    if @idea.update(idea_params)
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "ideas" SET "description" = $1, "updated_at" = $2 WHERE "ideas"."id" = $3  [["description", "What an okay idea!!"], ["updated_at", 2016-10-29 21:59:13 UTC], ["id", 19]]

  def destroy
    @idea = Idea.find(params[:id])
    @idea.destroy
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 24]]