app/controllers/sessions_controller.rb

  def index
    @user = User.find(session[:user]) if session[:user]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]